clc; close all; clear all;
 
init=[0.160102397974125
0.6038292697974729
0.7243085284385744
0.13842814590110342
-0.24229488706619015
-0.03224486958502952
0.07757149384006515
-0.006241490213011705
-0.012580751999015526
0.003335725285001549
];
    
N=length(init);
z=sqrt(2)*init;
y=z;
k=1;
 
for j=1:10
    x=y;
    h=[];
    for i=1:N
        h=[h,z(i)];
        if (i~=N)
            for j=1:2^k-1
                h=[h,0];
            end
        end
    end
    k=k+1;
    y=conv(x,h);
end
 
figure('Color','w') 
subplot(2,1,1);
plot(y,':', 'LineWidth', 5);
title('Исходные коэффициенты ДМС');
grid on
 
init=[0.1601161571707436
    0.6038940983851767
    0.7244163479319617
    0.1384812492045404
    -0.2423420484080499
    -0.03230788593836678
    0.07755405402661002
    -0.006239534505555287
    -0.0125821005559268
    0.003334483019543604
    ];
    
N=length(init);
z=sqrt(2)*init;
y=z;
k=1;
 
for j=1:10
    x=y;
    h=[];
    for i=1:N
        h=[h,z(i)];
        if (i~=N)
            for j=1:2^k-1
                h=[h,0];
            end
        end
    end
    k=k+1;
    y=conv(x,h);
end
 
subplot(2,1,2);
plot(y,'r--', 'LineWidth', 5);
title('Вычисленные коэффициенты ДМС')
grid on
